results/run-threshold-fail.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script-threshold-fail.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 30 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.8s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 30 VUs  0m00.8s/1m0s

running (0m01.8s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  0m01.8s/1m0s

running (0m02.8s), 30/30 VUs, 4 complete and 0 interrupted iterations
default   [   5% ] 30 VUs  0m02.8s/1m0s

running (0m03.9s), 30/30 VUs, 22 complete and 0 interrupted iterations
default   [   6% ] 30 VUs  0m03.9s/1m0s

running (0m04.9s), 30/30 VUs, 42 complete and 0 interrupted iterations
default   [   8% ] 30 VUs  0m04.9s/1m0s

running (0m05.9s), 30/30 VUs, 63 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  0m05.9s/1m0s

running (0m06.8s), 30/30 VUs, 83 complete and 0 interrupted iterations
default   [  11% ] 30 VUs  0m06.8s/1m0s

running (0m07.8s), 30/30 VUs, 105 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  0m07.8s/1m0s

running (0m08.8s), 30/30 VUs, 126 complete and 0 interrupted iterations
default   [  15% ] 30 VUs  0m08.8s/1m0s

running (0m09.8s), 30/30 VUs, 145 complete and 0 interrupted iterations
default   [  16% ] 30 VUs  0m09.8s/1m0s

running (0m10.8s), 30/30 VUs, 167 complete and 0 interrupted iterations
default   [  18% ] 30 VUs  0m10.8s/1m0s

running (0m11.8s), 30/30 VUs, 185 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  0m11.8s/1m0s

running (0m12.8s), 30/30 VUs, 207 complete and 0 interrupted iterations
default   [  21% ] 30 VUs  0m12.8s/1m0s

running (0m13.8s), 30/30 VUs, 224 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  0m13.8s/1m0s

running (0m14.8s), 30/30 VUs, 244 complete and 0 interrupted iterations
default   [  25% ] 30 VUs  0m14.8s/1m0s

running (0m15.8s), 30/30 VUs, 260 complete and 0 interrupted iterations
default   [  26% ] 30 VUs  0m15.8s/1m0s

running (0m16.8s), 30/30 VUs, 282 complete and 0 interrupted iterations
default   [  28% ] 30 VUs  0m16.8s/1m0s

running (0m17.9s), 30/30 VUs, 303 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  0m17.9s/1m0s

running (0m18.8s), 30/30 VUs, 321 complete and 0 interrupted iterations
default   [  31% ] 30 VUs  0m18.8s/1m0s

running (0m19.8s), 30/30 VUs, 338 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  0m19.8s/1m0s

running (0m20.8s), 30/30 VUs, 360 complete and 0 interrupted iterations
default   [  35% ] 30 VUs  0m20.8s/1m0s

running (0m21.9s), 30/30 VUs, 376 complete and 0 interrupted iterations
default   [  36% ] 30 VUs  0m21.9s/1m0s

running (0m22.8s), 30/30 VUs, 395 complete and 0 interrupted iterations
default   [  38% ] 30 VUs  0m22.8s/1m0s

running (0m23.8s), 30/30 VUs, 412 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  0m23.8s/1m0s

running (0m24.9s), 30/30 VUs, 434 complete and 0 interrupted iterations
default   [  41% ] 30 VUs  0m24.9s/1m0s

running (0m25.8s), 30/30 VUs, 457 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  0m25.8s/1m0s

running (0m26.8s), 30/30 VUs, 479 complete and 0 interrupted iterations
default   [  45% ] 30 VUs  0m26.8s/1m0s

running (0m27.8s), 30/30 VUs, 498 complete and 0 interrupted iterations
default   [  46% ] 30 VUs  0m27.8s/1m0s

running (0m28.8s), 30/30 VUs, 519 complete and 0 interrupted iterations
default   [  48% ] 30 VUs  0m28.8s/1m0s

running (0m29.8s), 30/30 VUs, 538 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  0m29.8s/1m0s

running (0m30.9s), 30/30 VUs, 558 complete and 0 interrupted iterations
default   [  51% ] 30 VUs  0m30.9s/1m0s

running (0m31.8s), 30/30 VUs, 577 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  0m31.8s/1m0s

running (0m32.8s), 30/30 VUs, 596 complete and 0 interrupted iterations
default   [  55% ] 30 VUs  0m32.8s/1m0s

running (0m33.8s), 30/30 VUs, 615 complete and 0 interrupted iterations
default   [  56% ] 30 VUs  0m33.8s/1m0s

running (0m34.8s), 30/30 VUs, 632 complete and 0 interrupted iterations
default   [  58% ] 30 VUs  0m34.8s/1m0s

running (0m35.8s), 30/30 VUs, 653 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  0m35.8s/1m0s

running (0m36.8s), 30/30 VUs, 671 complete and 0 interrupted iterations
default   [  61% ] 30 VUs  0m36.8s/1m0s

running (0m37.8s), 30/30 VUs, 690 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  0m37.8s/1m0s

running (0m38.8s), 30/30 VUs, 708 complete and 0 interrupted iterations
default   [  65% ] 30 VUs  0m38.8s/1m0s

running (0m39.8s), 30/30 VUs, 725 complete and 0 interrupted iterations
default   [  66% ] 30 VUs  0m39.8s/1m0s

running (0m40.9s), 30/30 VUs, 746 complete and 0 interrupted iterations
default   [  68% ] 30 VUs  0m40.9s/1m0s

running (0m41.8s), 30/30 VUs, 762 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  0m41.8s/1m0s

running (0m42.8s), 30/30 VUs, 780 complete and 0 interrupted iterations
default   [  71% ] 30 VUs  0m42.8s/1m0s

running (0m43.8s), 30/30 VUs, 790 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  0m43.8s/1m0s

running (0m44.8s), 30/30 VUs, 813 complete and 0 interrupted iterations
default   [  75% ] 30 VUs  0m44.8s/1m0s

running (0m45.8s), 30/30 VUs, 830 complete and 0 interrupted iterations
default   [  76% ] 30 VUs  0m45.8s/1m0s

running (0m46.8s), 30/30 VUs, 846 complete and 0 interrupted iterations
default   [  78% ] 30 VUs  0m46.8s/1m0s

running (0m47.8s), 30/30 VUs, 867 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  0m47.8s/1m0s

running (0m48.8s), 30/30 VUs, 882 complete and 0 interrupted iterations
default   [  81% ] 30 VUs  0m48.8s/1m0s

running (0m49.8s), 30/30 VUs, 903 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  0m49.8s/1m0s

running (0m50.8s), 30/30 VUs, 925 complete and 0 interrupted iterations
default   [  85% ] 30 VUs  0m50.8s/1m0s

running (0m51.8s), 30/30 VUs, 942 complete and 0 interrupted iterations
default   [  86% ] 30 VUs  0m51.8s/1m0s

running (0m52.9s), 30/30 VUs, 956 complete and 0 interrupted iterations
default   [  88% ] 30 VUs  0m52.8s/1m0s

running (0m53.8s), 30/30 VUs, 979 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  0m53.8s/1m0s

running (0m54.8s), 30/30 VUs, 994 complete and 0 interrupted iterations
default   [  91% ] 30 VUs  0m54.8s/1m0s

running (0m55.8s), 30/30 VUs, 1016 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  0m55.8s/1m0s

running (0m56.8s), 30/30 VUs, 1033 complete and 0 interrupted iterations
default   [  95% ] 30 VUs  0m56.8s/1m0s

running (0m57.8s), 30/30 VUs, 1050 complete and 0 interrupted iterations
default   [  96% ] 30 VUs  0m57.8s/1m0s

running (0m58.9s), 30/30 VUs, 1070 complete and 0 interrupted iterations
default   [  98% ] 30 VUs  0m58.9s/1m0s

running (0m59.8s), 30/30 VUs, 1089 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  0m59.8s/1m0s

running (1m00.8s), 15/30 VUs, 1106 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  1m0s

running (1m01.8s), 03/30 VUs, 1118 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  1m0s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<50' p(95)=1.11s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1121    17.99446/s
    checks_succeeded...: 100.00% 1121 out of 1121
    checks_failed......: 0.00%   0 out of 1121

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=286.12ms min=54.63ms med=223.67ms max=2.02s p(90)=752.77ms p(95)=1.11s
      { expected_response:true }...: avg=286.12ms min=54.63ms med=223.67ms max=2.02s p(90)=752.77ms p(95)=1.11s
    http_req_failed................: 0.00%  0 out of 2242
    http_reqs......................: 2242   35.98892/s

    EXECUTION
    iteration_duration.............: avg=1.63s    min=1.27s   med=1.51s    max=4.86s p(90)=2.22s    p(95)=2.48s
    iterations.....................: 1121   17.99446/s
    vus............................: 3      min=3         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 4.4 MB 70 kB/s
    data_sent......................: 206 kB 3.3 kB/s



running (1m02.3s), 00/30 VUs, 1121 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  1m0s
time="2026-09-15T20:16:29+08:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"